import { ProductTarget } from "../core/types";

export const DEFAULT_TARGET: ProductTarget = {
  brand: "잘나가는 미트",
  products: [
    { 
      // 실제 쿠팡에서 등록하는 제품 id
      productId: "9288498572",
      category: "보쌈",
      // 실제 진만이 니가 등록한 상품명 
      exactNames: [
        "국내산 한돈 통 오겹살 저당 저칼로리 한방 보쌈 수육, 1개, 300g",
        "국내산 한돈 통 오겹살 저당 저칼로리 한방 보쌈 수육, 2개, 300g",
        "국내산 한돈 통 오겹살 저당 저칼로리 한방 보쌈 수육, 3개, 300g",
        "국내산 한돈 통 오겹살 저당 저칼로리 한방 보쌈 수육, 4개, 300g",
        "국내산 한돈 통 오겹살 저당 저칼로리 한방 보쌈 수육, 5개, 300g"
      ],
      // 쿠팡 검색창에 검색할때 사용하는키워드 brand + 랜덤한 keyword
      keywords: [
        "한방",
        "한방 보쌈",
        "한방 수육",
        "국내산 한돈 통 오겹살 저당 저칼로리",
        "국내산 한돈 통 오겹살 저당",
        "국내산 한돈 통 오겹살 저당 저칼로리 한방",
        "국내산 한돈 통 오겹살 저당 저칼로리 한방 보쌈",
        "국내산 한돈 통 오겹살 저당 저칼로리 한방 보쌈 수육"
      ] 
    }, {
        productId: "9483036408",
        category: "반반팩", 
        exactNames: [
          "국내산 한돈 삼겹살 500g 목살 500g 반반팩 냉동 돼지고기 캠핑 구이 볶음 찌개용, 1세트, 1kg"
        ],
        keywords: [
          "반반팩 냉동 돼지고기",
          "국내산 한돈반반팩 냉동 돼지고기",
          "국내산 한돈 반반팩 냉동 돼지고기",
          "국내산 한돈 삼겹살 500g 목살 500g 반반팩 냉동 돼지고기",
          "국내산 한돈 삼겹살 500g 반반팩 냉동 돼지고기",
          "국내산 한돈 목살 500g 반반팩 냉동 돼지고기",
          "반반팩 냉동 돼지고기 캠핑",
          "국내산 한돈반반팩 냉동 돼지고기 캠핑",
          "국내산 한돈 반반팩 냉동 돼지고기 캠핑",
          "국내산 한돈 삼겹살 500g 목살 500g 반반팩 냉동 돼지고기 캠핑",
          "국내산 한돈 삼겹살 500g 반반팩 냉동 돼지고기 캠핑",
          "국내산 한돈 목살 500g 반반팩 냉동 돼지고기 캠핑"
        ] 
    }, { 
      productId: "9052369498",
      category: "등갈비",
      exactNames: [
        "[잘나가는 미트] 국내산 한돈 돼지고기 등갈비 (냉동), 1개, 1kg",
        "[잘나가는 미트] 국내산 한돈 돼지고기 등갈비 (냉동), 2개, 1kg",
        "[잘나가는 미트] 국내산 한돈 돼지고기 등갈비 (냉동), 3개, 1kg"
      ],
      keywords: [
        "한돈",
        "등갈비",
        "등갈비 국내산 한돈",
        "등갈비 국내산 한돈 돼지고기",
        "국내산 한돈 돼지고기 등갈비",
      ] 
    }, {
      productId: "9605666649",
      category: "불족발",
      exactNames: [
        "국내산 한돈 매콤 무뼈 순살 족발 불족발 뼈없는 냉동 족발 잘나가는 미트, 1개, 500g",
        "국내산 한돈 매콤 무뼈 순살 족발 불족발 뼈없는 냉동 족발 잘나가는 미트, 2개, 500g",
        "국내산 한돈 매콤 무뼈 순살 족발 불족발 뼈없는 냉동 족발 잘나가는 미트, 3개, 500g",
        "국내산 한돈 매콤 무뼈 순살 족발 불족발 뼈없는 냉동 족발 잘나가는 미트, 4개, 500g",
        "국내산 한돈 매콤 무뼈 순살 족발 불족발 뼈없는 냉동 족발 잘나가는 미트, 5개, 500g",
        "국내산 한돈 매콤 무뼈 순살 족발 불족발 뼈없는 냉동 족발 잘나가는 미트, 6개, 500g",
      ],
      keywords: [
        "한돈 매콤",
        "한돈 매콤 족발",
        "한돈 매콤 족발 뼈없는",
        "한돈 매콤 족발 냉동",
        "한돈 매콤 족발 뼈없는 냉동",
        "한돈 매콤 족발 불족발",
        "한돈 매콤 족발 불족발 뼈없는",
        "한돈 매콤 족발 불족발 뼈없는 냉동",
        "한돈 매콤 족발 불족발 뼈없는 냉동 족발",
        "한돈 매콤 족발 냉동 족발",
        "한돈 매콤 순살 족발",
        "한돈 매콤 순살 족발 뼈없는",
        "한돈 매콤 순살 족발 냉동",
        "한돈 매콤 순살 족발 뼈없는 냉동",
        "한돈 매콤 순살 족발 불족발",
        "한돈 매콤 순살 족발 불족발 뼈없는",
        "한돈 매콤 순살 족발 불족발 뼈없는 냉동",
        "한돈 매콤 순살 족발 불족발 뼈없는 냉동 족발",
        "국내산 한돈 매콤",
        "국내산 한돈 매콤 족발",
        "국내산 한돈 매콤 족발 뼈없는",
        "국내산 한돈 매콤 족발 냉동",
        "국내산 한돈 매콤 족발 뼈없는 냉동",
        "국내산 한돈 매콤 족발 불족발",
        "국내산 한돈 매콤 족발 불족발 뼈없는",
        "국내산 한돈 매콤 족발 불족발 뼈없는 냉동",
        "국내산 한돈 매콤 족발 불족발 뼈없는 냉동 족발",
        "국내산 한돈 매콤 족발 냉동 족발",
        "국내산 한돈 매콤 순살 족발",
        "국내산 한돈 매콤 순살 족발 뼈없는",
        "국내산 한돈 매콤 순살 족발 냉동",
        "국내산 한돈 매콤 순살 족발 뼈없는 냉동",
        "국내산 한돈 매콤 순살 족발 불족발",
        "국내산 한돈 매콤 순살 족발 불족발 뼈없는",
        "국내산 한돈 매콤 순살 족발 불족발 뼈없는 냉동",
        "국내산 한돈 매콤 순살 족발 불족발 뼈없는 냉동 족발"
      ]
    }
  ],
};
