import { ProductTarget } from "../core/types";

export const DEFAULT_TARGET: ProductTarget = {
  brand: "잘나가는 미트",
  products: [
    { 
      // 실제 쿠팡에서 등록하는 제품 id
      productId: "9288498572",
      // 실제 진만이 니가 등록한 상품명 
      exactNames: [
        "국내산 한돈 통 오겹살 저당 저칼로리 한방 보쌈 수육, 1개, 300g",
        "국내산 한돈 통 오겹살 저당 저칼로리 한방 보쌈 수육, 2개, 300g",
        "국내산 한돈 통 오겹살 저당 저칼로리 한방 보쌈 수육, 3개, 300g",
        "국내산 한돈 통 오겹살 저당 저칼로리 한방 보쌈 수육, 4개, 300g",
        "국내산 한돈 통 오겹살 저당 저칼로리 한방 보쌈 수육, 5개, 300g"
      ],
      // 쿠팡 검색창에 검색할때 사용하는키워드 brand + 랜덤한 keyword
      keywords: [
        "한방",
        "한방 보쌈",
        "한방 수육",
        "국내산 한돈 통 오겹살 저당 저칼로리",
        "국내산 한돈 통 오겹살 저당",
        "국내산 한돈 통 오겹살 저당 저칼로리 한방",
        "국내산 한돈 통 오겹살 저당 저칼로리 한방 보쌈",
        "국내산 한돈 통 오겹살 저당 저칼로리 한방 보쌈 수육"
      ] 
    },
    // { 
    //   productId: "9052369498", 
    //   exactNames: [
    //     "[잘나가는 미트] 국내산 한돈 돼지고기 등갈비 (냉동), 1개, 1kg",
    //     "[잘나가는 미트] 국내산 한돈 돼지고기 등갈비 (냉동), 2개, 1kg",
    //     "[잘나가는 미트] 국내산 한돈 돼지고기 등갈비 (냉동), 3개, 1kg"
    //   ],
    //   keywords: [
    //     "한돈",
    //     "등갈비",
    //     "등갈비 국내산 한돈",
    //     "등갈비 국내산 한돈 돼지고기",
    //     "국내산 한돈 돼지고기 등갈비",
    //   ] 
    // },
  ],
};
